---
kind: method
id: M:Autodesk.Revit.DB.Transform2D.SetToIdentity
source: html/fbc7f0fe-3e4c-f2f0-ce2c-478a202cd1e2.htm
---
# Autodesk.Revit.DB.Transform2D.SetToIdentity Method

Set this TrfUV to the identity transform.

## Syntax (C#)
```csharp
public Transform2D SetToIdentity()
```

## Returns
Returns a pointer to "this" Transform2D .